      *> EQUATION PARAMETERS
       01 1V-A       PIC S9(8)V9(10) COMP.
       01 1V-B       PIC S9(8)V9(10) COMP.
      
      *> RESULT VARIABLE
       01 1V-X       PIC S9(8)V9(10) COMP.
       01 1V-NO-SOL  PIC 9 VALUE 0.

